{
    "Children Crossing Ahead": {
        "Children Crossing Ahead": "Be cautious, children crossing ahead.",
        "Double Bend to Left Ahead": "Prepare for a double bend to the left ahead.",
        "Double Bend to Right Ahead": "Prepare for a double bend to the right ahead.",
        "Left Bend Ahead": "Caution, a left bend is ahead.",
        "Level Crossing with Gates Ahead": "Level crossing with gates ahead, proceed carefully.",
        "No Entry": "No entry ahead, please adjust your route.",
        "No Left Turn": "No left turn allowed ahead, stay on the route.",
        "No Right Turn": "No right turn allowed ahead, plan accordingly.",
        "No U-turn": "No U-turn allowed ahead, stay cautious.",
        "Pedestrian Crossing": "Pedestrian crossing ahead, watch for pedestrians.",
        "Pedestrian Crossing Ahead": "Pedestrian crossing is coming up, reduce speed.",
        "Right Bend Ahead": "Caution, a right bend is ahead.",
        "Road Narrows Ahead": "The road narrows ahead, drive carefully.",
        "Road Narrows on the Left Side Ahead": "The road narrows on the left side ahead, stay alert.",
        "Road Narrows on the Right Side Ahead": "The road narrows on the right side ahead, keep caution.",
        "Road Work Ahead": "Road work ahead, slow down and stay cautious.",
        "Speed Limit 100km/h": "Speed limit is 100 kilometers per hour, maintain speed accordingly.",
        "Speed Limit 60km/h": "Speed limit is 60 kilometers per hour, adjust speed.",
        "Speed Limit 70km/h": "Speed limit is 70 kilometers per hour, drive safely.",
        "Speed Limit 80km/h": "Speed limit is 80 kilometers per hour, keep within limit."
    },
    "Double Bend to Left Ahead": {
        "Children Crossing Ahead": "After the double bend to the left, watch for children crossing ahead.",
        "Double Bend to Left Ahead": "Prepare for another double bend to the left ahead.",
        "Double Bend to Right Ahead": "After the double bend to the left, prepare for a double bend to the right.",
        "Left Bend Ahead": "After the double bend to the left, a left bend is ahead.",
        "Level Crossing with Gates Ahead": "After the double bend to the left, level crossing with gates ahead.",
        "No Entry": "After the double bend to the left, no entry is ahead, adjust your route.",
        "No Left Turn": "After the double bend to the left, no left turn is allowed ahead.",
        "No Right Turn": "After the double bend to the left, no right turn is allowed ahead.",
        "No U-turn": "After the double bend to the left, no U-turn is allowed ahead.",
        "Pedestrian Crossing": "After the double bend to the left, there is a pedestrian crossing ahead.",
        "Pedestrian Crossing Ahead": "After the double bend to the left, a pedestrian crossing is coming up.",
        "Right Bend Ahead": "After the double bend to the left, a right bend is ahead.",
        "Road Narrows Ahead": "After the double bend to the left, the road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "After the double bend to the left, the road narrows on the left side ahead.",
        "Road Narrows on the Right Side Ahead": "After the double bend to the left, the road narrows on the right side ahead.",
        "Road Work Ahead": "After the double bend to the left, road work is ahead.",
        "Speed Limit 100km/h": "After the double bend to the left, the speed limit is 100 kilometers per hour.",
        "Speed Limit 60km/h": "After the double bend to the left, the speed limit is 60 kilometers per hour.",
        "Speed Limit 70km/h": "After the double bend to the left, the speed limit is 70 kilometers per hour.",
        "Speed Limit 80km/h": "After the double bend to the left, the speed limit is 80 kilometers per hour."
    },
    "Double Bend to Right Ahead": {
        "Children Crossing Ahead": "After the double bend to the right, watch for children crossing ahead.",
        "Double Bend to Left Ahead": "After the double bend to the right, prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "Prepare for another double bend to the right ahead.",
        "Left Bend Ahead": "After the double bend to the right, a left bend is ahead.",
        "Level Crossing with Gates Ahead": "After the double bend to the right, level crossing with gates ahead.",
        "No Entry": "After the double bend to the right, no entry is ahead, adjust your route.",
        "No Left Turn": "After the double bend to the right, no left turn is allowed ahead.",
        "No Right Turn": "After the double bend to the right, no right turn is allowed ahead.",
        "No U-turn": "After the double bend to the right, no U-turn is allowed ahead.",
        "Pedestrian Crossing": "After the double bend to the right, there is a pedestrian crossing ahead.",
        "Pedestrian Crossing Ahead": "After the double bend to the right, a pedestrian crossing is coming up.",
        "Right Bend Ahead": "After the double bend to the right, a right bend is ahead.",
        "Road Narrows Ahead": "After the double bend to the right, the road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "After the double bend to the right, the road narrows on the left side ahead.",
        "Road Narrows on the Right Side Ahead": "After the double bend to the right, the road narrows on the right side ahead.",
        "Road Work Ahead": "After the double bend to the right, road work is ahead.",
        "Speed Limit 100km/h": "After the double bend to the right, the speed limit is 100 kilometers per hour.",
        "Speed Limit 60km/h": "After the double bend to the right, the speed limit is 60 kilometers per hour.",
        "Speed Limit 70km/h": "After the double bend to the right, the speed limit is 70 kilometers per hour.",
        "Speed Limit 80km/h": "After the double bend to the right, the speed limit is 80 kilometers per hour."
    },
    "Left Bend Ahead": {
        "Children Crossing Ahead": "After the left bend, watch for children crossing ahead.",
        "Double Bend to Left Ahead": "After the left bend, prepare for a double bend to the left ahead.",
        "Double Bend to Right Ahead": "After the left bend, prepare for a double bend to the right ahead.",
        "Left Bend Ahead": "Prepare for another left bend ahead.",
        "Level Crossing with Gates Ahead": "After the left bend, level crossing with gates ahead.",
        "No Entry": "After the left bend, no entry is ahead, adjust your route.",
        "No Left Turn": "After the left bend, no left turn is allowed ahead.",
        "No Right Turn": "After the left bend, no right turn is allowed ahead.",
        "No U-turn": "After the left bend, no U-turn is allowed ahead.",
        "Pedestrian Crossing": "After the left bend, there is a pedestrian crossing ahead.",
        "Pedestrian Crossing Ahead": "After the left bend, a pedestrian crossing is coming up.",
        "Right Bend Ahead": "After the left bend, a right bend is ahead.",
        "Road Narrows Ahead": "After the left bend, the road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "After the left bend, the road narrows on the left side ahead.",
        "Road Narrows on the Right Side Ahead": "After the left bend, the road narrows on the right side ahead.",
        "Road Work Ahead": "After the left bend, road work is ahead.",
        "Speed Limit 100km/h": "After the left bend, the speed limit is 100 kilometers per hour.",
        "Speed Limit 60km/h": "After the left bend, the speed limit is 60 kilometers per hour.",
        "Speed Limit 70km/h": "After the left bend, the speed limit is 70 kilometers per hour.",
        "Speed Limit 80km/h": "After the left bend, the speed limit is 80 kilometers per hour."
    },
    "Level Crossing with Gates Ahead": {
        "Children Crossing Ahead": "After the level crossing with gates, watch for children crossing ahead.",
        "Double Bend to Left Ahead": "After the level crossing with gates, prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "After the level crossing with gates, prepare for a double bend to the right.",
        "Left Bend Ahead": "After the level crossing with gates, a left bend is ahead.",
        "Level Crossing with Gates Ahead": "level crossing with gates ahead, drive carefully.",
        "No Entry": "After the level crossing with gates, no entry is ahead, adjust your route.",
        "No Left Turn": "After the level crossing with gates, no left turn is allowed ahead.",
        "No Right Turn": "After the level crossing with gates, no right turn is allowed ahead.",
        "No U-turn": "After the level crossing with gates, no U-turn is allowed ahead.",
        "Pedestrian Crossing": "After the level crossing with gates, there is a pedestrian crossing ahead.",
        "Pedestrian Crossing Ahead": "After the level crossing with gates, a pedestrian crossing is coming up.",
        "Right Bend Ahead": "After the level crossing with gates, a right bend is ahead.",
        "Road Narrows Ahead": "After the level crossing with gates, the road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "After the level crossing with gates, the road narrows on the left side ahead.",
        "Road Narrows on the Right Side Ahead": "After the level crossing with gates, the road narrows on the right side ahead.",
        "Road Work Ahead": "After the level crossing with gates, road work is ahead.",
        "Speed Limit 100km/h": "After the level crossing with gates, the speed limit is 100 kilometers per hour.",
        "Speed Limit 60km/h": "After the level crossing with gates, the speed limit is 60 kilometers per hour.",
        "Speed Limit 70km/h": "After the level crossing with gates, the speed limit is 70 kilometers per hour.",
        "Speed Limit 80km/h": "After the level crossing with gates, the speed limit is 80 kilometers per hour."
    },
    "No Entry": {
        "Children Crossing Ahead": "After the no entry, watch for children crossing ahead.",
        "Double Bend to Left Ahead": "After the no entry, prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "After the no entry, prepare for a double bend to the right.",
        "Left Bend Ahead": "After the no entry, a left bend is ahead.",
        "Level Crossing with Gates Ahead": "After the no entry, level crossing with gates ahead.",
        "No Entry": "Another no entry is ahead, You may not enter this area.",
        "No Left Turn": "After the no entry, no left turn is allowed ahead.",
        "No Right Turn": "After the no entry, no right turn is allowed ahead.",
        "No U-turn": "After the no entry, no U-turn is allowed ahead.",
        "Pedestrian Crossing": "After the no entry, there is a pedestrian crossing ahead.",
        "Pedestrian Crossing Ahead": "After the no entry, a pedestrian crossing is coming up.",
        "Right Bend Ahead": "After the no entry, a right bend is ahead.",
        "Road Narrows Ahead": "After the no entry, the road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "After the no entry, the road narrows on the left side ahead.",
        "Road Narrows on the Right Side Ahead": "After the no entry, the road narrows on the right side ahead.",
        "Road Work Ahead": "After the no entry, road work is ahead.",
        "Speed Limit 100km/h": "After the no entry, the speed limit is 100 kilometers per hour.",
        "Speed Limit 60km/h": "After the no entry, the speed limit is 60 kilometers per hour.",
        "Speed Limit 70km/h": "After the no entry, the speed limit is 70 kilometers per hour.",
        "Speed Limit 80km/h": "After the no entry, the speed limit is 80 kilometers per hour."
    },
    "No Left Turn": {
        "Children Crossing Ahead": "After the no left turn, watch for children crossing ahead.",
        "Double Bend to Left Ahead": "After the no left turn, prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "After the no left turn, prepare for a double bend to the right.",
        "Left Bend Ahead": "After the no left turn, a left bend is ahead.",
        "Level Crossing with Gates Ahead": "After the no left turn, level crossing with gates ahead.",
        "No Entry": "After the no left turn, no entry is ahead, plan your route.",
        "No Left Turn": "Another no left turn is ahead, follow the route.",
        "No Right Turn": "After the no left turn, no right turn is allowed ahead.",
        "No U-turn": "After the no left turn, no U-turn is allowed ahead.",
        "Pedestrian Crossing": "After the no left turn, there is a pedestrian crossing ahead.",
        "Pedestrian Crossing Ahead": "After the no left turn, a pedestrian crossing is coming up.",
        "Right Bend Ahead": "After the no left turn, a right bend is ahead.",
        "Road Narrows Ahead": "After the no left turn, the road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "After the no left turn, the road narrows on the left side ahead.",
        "Road Narrows on the Right Side Ahead": "After the no left turn, the road narrows on the right side ahead.",
        "Road Work Ahead": "After the no left turn, road work is ahead.",
        "Speed Limit 100km/h": "After the no left turn, the speed limit is 100 kilometers per hour.",
        "Speed Limit 60km/h": "After the no left turn, the speed limit is 60 kilometers per hour.",
        "Speed Limit 70km/h": "After the no left turn, the speed limit is 70 kilometers per hour.",
        "Speed Limit 80km/h": "After the no left turn, the speed limit is 80 kilometers per hour."
    },
    "No Right Turn": {
        "Children Crossing Ahead": "No right turn. Watch for children crossing ahead.",
        "Double Bend to Left Ahead": "No right turn. A double bend to the left is ahead.",
        "Double Bend to Right Ahead": "No right turn. Get ready for a double bend to the right.",
        "Left Bend Ahead": "No right turn. A left bend is coming up.",
        "Level Crossing with Gates Ahead": "No right turn. Level crossing with gates ahead.",
        "No Entry": "No right turn. No entry is ahead, plan your route.",
        "No Left Turn": "No right turn. No left turn is allowed ahead either.",
        "No Right Turn": "No right turn ahead, stick to the route.",
        "No U-turn": "No right turn. No U-turns are allowed either.",
        "Pedestrian Crossing": "No right turn. Pedestrian crossing ahead.",
        "Pedestrian Crossing Ahead": "No right turn. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "No right turn. A right bend is ahead.",
        "Road Narrows Ahead": "No right turn. The road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "No right turn. The road narrows on the left side ahead.",
        "Road Narrows on the Right Side Ahead": "No right turn. The road narrows on the right side ahead.",
        "Road Work Ahead": "No right turn. Road work is ahead.",
        "Speed Limit 100km/h": "No right turn. Speed limit is 100 km/h ahead.",
        "Speed Limit 60km/h": "No right turn. Speed limit is 60 km/h ahead.",
        "Speed Limit 70km/h": "No right turn. Speed limit is 70 km/h ahead.",
        "Speed Limit 80km/h": "No right turn. Speed limit is 80 km/h ahead."
    },
    "No U-turn": {
        "Children Crossing Ahead": "No U-turn. Watch for children crossing ahead.",
        "Double Bend to Left Ahead": "No U-turn. A double bend to the left is ahead.",
        "Double Bend to Right Ahead": "No U-turn. Get ready for a double bend to the right.",
        "Left Bend Ahead": "No U-turn. A left bend is coming up.",
        "Level Crossing with Gates Ahead": "No U-turn. Level crossing with gates ahead.",
        "No Entry": "No U-turn. No entry is ahead, plan your route.",
        "No Left Turn": "No U-turn. No left turn is allowed ahead either.",
        "No Right Turn": "No U-turn. No right turn is allowed ahead either.",
        "No U-turn": "No U-turn ahead, keep going straight.",
        "Pedestrian Crossing": "No U-turn. Pedestrian crossing ahead.",
        "Pedestrian Crossing Ahead": "No U-turn. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "No U-turn. A right bend is ahead.",
        "Road Narrows Ahead": "No U-turn. The road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "No U-turn. The road narrows on the left side ahead.",
        "Road Narrows on the Right Side Ahead": "No U-turn. The road narrows on the right side ahead.",
        "Road Work Ahead": "No U-turn. Road work is ahead.",
        "Speed Limit 100km/h": "No U-turn. Speed limit is 100 km/h ahead.",
        "Speed Limit 60km/h": "No U-turn. Speed limit is 60 km/h ahead.",
        "Speed Limit 70km/h": "No U-turn. Speed limit is 70 km/h ahead.",
        "Speed Limit 80km/h": "No U-turn. Speed limit is 80 km/h ahead."
    },
    "Pedestrian Crossing": {
        "Children Crossing Ahead": "Pedestrian crossing ahead. Watch for children.",
        "Double Bend to Left Ahead": "Pedestrian crossing ahead. A double bend to the left is coming up.",
        "Double Bend to Right Ahead": "Pedestrian crossing ahead. Prepare for a double bend to the right.",
        "Left Bend Ahead": "Pedestrian crossing ahead. A left bend is ahead.",
        "Level Crossing with Gates Ahead": "Pedestrian crossing ahead. Level crossing with gates is coming up.",
        "No Entry": "Pedestrian crossing ahead. No entry is ahead, plan your route.",
        "No Left Turn": "Pedestrian crossing ahead. No left turn is allowed ahead.",
        "No Right Turn": "Pedestrian crossing ahead. No right turn is allowed ahead.",
        "No U-turn": "Pedestrian crossing ahead. No U-turn is allowed.",
        "Pedestrian Crossing": "Pedestrian crossing ahead. Slow down and be cautious.",
        "Pedestrian Crossing Ahead": "Pedestrian crossing coming up. Stay alert.",
        "Right Bend Ahead": "Pedestrian crossing ahead. A right bend is coming up.",
        "Road Narrows Ahead": "Pedestrian crossing ahead. The road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "Pedestrian crossing ahead. The road narrows on the left side.",
        "Road Narrows on the Right Side Ahead": "Pedestrian crossing ahead. The road narrows on the right side.",
        "Road Work Ahead": "Pedestrian crossing ahead. Road work is ahead.",
        "Speed Limit 100km/h": "Pedestrian crossing ahead. Speed limit is 100 km/h ahead.",
        "Speed Limit 60km/h": "Pedestrian crossing ahead. Speed limit is 60 km/h ahead.",
        "Speed Limit 70km/h": "Pedestrian crossing ahead. Speed limit is 70 km/h ahead.",
        "Speed Limit 80km/h": "Pedestrian crossing ahead. Speed limit is 80 km/h ahead."
    },
    "Pedestrian Crossing Ahead": {
        "Children Crossing Ahead": "Pedestrian crossing ahead. Watch for children.",
        "Double Bend to Left Ahead": "Pedestrian crossing ahead. A double bend to the left is coming up.",
        "Double Bend to Right Ahead": "Pedestrian crossing ahead. Prepare for a double bend to the right.",
        "Left Bend Ahead": "Pedestrian crossing ahead. A left bend is ahead.",
        "Level Crossing with Gates Ahead": "Pedestrian crossing ahead. Level crossing with gates is coming up.",
        "No Entry": "Pedestrian crossing ahead. No entry is ahead, plan your route.",
        "No Left Turn": "Pedestrian crossing ahead. No left turn is allowed ahead.",
        "No Right Turn": "Pedestrian crossing ahead. No right turn is allowed ahead.",
        "No U-turn": "Pedestrian crossing ahead. No U-turn is allowed.",
        "Pedestrian Crossing": "Pedestrian crossing ahead. Slow down and be cautious.",
        "Pedestrian Crossing Ahead": "Pedestrian crossing coming up. Stay alert.",
        "Right Bend Ahead": "Pedestrian crossing ahead. A right bend is coming up.",
        "Road Narrows Ahead": "Pedestrian crossing ahead. The road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "Pedestrian crossing ahead. The road narrows on the left side.",
        "Road Narrows on the Right Side Ahead": "Pedestrian crossing ahead. The road narrows on the right side.",
        "Road Work Ahead": "Pedestrian crossing ahead. Road work is ahead.",
        "Speed Limit 100km/h": "Pedestrian crossing ahead. Speed limit is 100 km/h ahead.",
        "Speed Limit 60km/h": "Pedestrian crossing ahead. Speed limit is 60 km/h ahead.",
        "Speed Limit 70km/h": "Pedestrian crossing ahead. Speed limit is 70 km/h ahead.",
        "Speed Limit 80km/h": "Pedestrian crossing ahead. Speed limit is 80 km/h ahead."
    },
    "Right Bend Ahead": {
        "Children Crossing Ahead": "Right bend ahead. Watch for children crossing.",
        "Double Bend to Left Ahead": "Right bend ahead. Prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "Right bend ahead. Another right bend is coming up.",
        "Left Bend Ahead": "Right bend ahead. A left bend is coming up next.",
        "Level Crossing with Gates Ahead": "Right bend ahead. Level crossing with gates is coming up.",
        "No Entry": "Right bend ahead. No entry is ahead, plan your route.",
        "No Left Turn": "Right bend ahead. No left turn is allowed ahead.",
        "No Right Turn": "Right bend ahead. No right turn is allowed ahead.",
        "No U-turn": "Right bend ahead. No U-turn is allowed.",
        "Pedestrian Crossing": "Right bend ahead. Watch for pedestrians crossing.",
        "Pedestrian Crossing Ahead": "Right bend ahead. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "Right bend ahead. Stay on course.",
        "Road Narrows Ahead": "Right bend ahead. The road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "Right bend ahead. The road narrows on the left side.",
        "Road Narrows on the Right Side Ahead": "Right bend ahead. The road narrows on the right side.",
        "Road Work Ahead": "Right bend ahead. Road work is ahead.",
        "Speed Limit 100km/h": "Right bend ahead. Speed limit is 100 km/h.",
        "Speed Limit 60km/h": "Right bend ahead. Speed limit is 60 km/h.",
        "Speed Limit 70km/h": "Right bend ahead. Speed limit is 70 km/h.",
        "Speed Limit 80km/h": "Right bend ahead. Speed limit is 80 km/h."
    },
    "Road Narrows Ahead": {
        "Children Crossing Ahead": "Road narrows ahead. Watch for children crossing.",
        "Double Bend to Left Ahead": "Road narrows ahead. Prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "Road narrows ahead. Get ready for a double bend to the right.",
        "Left Bend Ahead": "Road narrows ahead. A left bend is coming up.",
        "Level Crossing with Gates Ahead": "Road narrows ahead. Level crossing with gates is ahead.",
        "No Entry": "Road narrows ahead. No entry is ahead, plan your route.",
        "No Left Turn": "Road narrows ahead. No left turn is allowed ahead.",
        "No Right Turn": "Road narrows ahead. No right turn is allowed ahead.",
        "No U-turn": "Road narrows ahead. No U-turn is allowed.",
        "Pedestrian Crossing": "Road narrows ahead. Watch for pedestrians crossing.",
        "Pedestrian Crossing Ahead": "Road narrows ahead. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "Road narrows ahead. A right bend is ahead.",
        "Road Narrows Ahead": "The road narrows ahead. Slow down.",
        "Road Narrows on the Left Side Ahead": "Road narrows ahead. The left side is getting narrower.",
        "Road Narrows on the Right Side Ahead": "Road narrows ahead. The right side is getting narrower.",
        "Road Work Ahead": "Road narrows ahead. Road work is ahead.",
        "Speed Limit 100km/h": "Road narrows ahead. Speed limit is 100 km/h.",
        "Speed Limit 60km/h": "Road narrows ahead. Speed limit is 60 km/h.",
        "Speed Limit 70km/h": "Road narrows ahead. Speed limit is 70 km/h.",
        "Speed Limit 80km/h": "Road narrows ahead. Speed limit is 80 km/h."
    },
    "Road Narrows on the Left Side Ahead": {
        "Children Crossing Ahead": "Road narrows on the left side ahead. Watch for children crossing.",
        "Double Bend to Left Ahead": "Road narrows on the left side ahead. Prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "Road narrows on the left side ahead. A double bend to the right is coming up.",
        "Left Bend Ahead": "Road narrows on the left side ahead. A left bend is ahead.",
        "Level Crossing with Gates Ahead": "Road narrows on the left side ahead. Level crossing with gates is coming up.",
        "No Entry": "Road narrows on the left side ahead. No entry is ahead, plan your route.",
        "No Left Turn": "Road narrows on the left side ahead. No left turn is allowed ahead.",
        "No Right Turn": "Road narrows on the left side ahead. No right turn is allowed ahead.",
        "No U-turn": "Road narrows on the left side ahead. No U-turn is allowed.",
        "Pedestrian Crossing": "Road narrows on the left side ahead. Watch for pedestrians crossing.",
        "Pedestrian Crossing Ahead": "Road narrows on the left side ahead. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "Road narrows on the left side ahead. A right bend is coming up.",
        "Road Narrows Ahead": "Road narrows on the left side ahead. Slow down.",
        "Road Narrows on the Left Side Ahead": "The road narrows on the left side. Keep left.",
        "Road Narrows on the Right Side Ahead": "Road narrows on the left side ahead. The right side is clear.",
        "Road Work Ahead": "Road narrows on the left side ahead. Road work is ahead.",
        "Speed Limit 100km/h": "Road narrows on the left side ahead. Speed limit is 100 km/h.",
        "Speed Limit 60km/h": "Road narrows on the left side ahead. Speed limit is 60 km/h.",
        "Speed Limit 70km/h": "Road narrows on the left side ahead. Speed limit is 70 km/h.",
        "Speed Limit 80km/h": "Road narrows on the left side ahead. Speed limit is 80 km/h."
    },
    "Road Narrows on the Right Side Ahead": {
        "Children Crossing Ahead": "Road narrows on the right side ahead. Watch for children crossing.",
        "Double Bend to Left Ahead": "Road narrows on the right side ahead. Prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "Road narrows on the right side ahead. A double bend to the right is coming up.",
        "Left Bend Ahead": "Road narrows on the right side ahead. A left bend is ahead.",
        "Level Crossing with Gates Ahead": "You should be careful; there is a level crossing with gates ahead.",
        "No Entry": "Road narrows on the right side ahead. No entry is ahead, plan your route.",
        "No Left Turn": "Road narrows on the right side ahead. No left turn is allowed ahead.",
        "No Right Turn": "Road narrows on the right side ahead. No right turn is allowed ahead.",
        "No U-turn": "Road narrows on the right side ahead. No U-turn is allowed.",
        "Pedestrian Crossing": "Road narrows on the right side ahead. Watch for pedestrians crossing.",
        "Pedestrian Crossing Ahead": "Road narrows on the right side ahead. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "Road narrows on the right side ahead. A right bend is coming up.",
        "Road Narrows Ahead": "Road narrows on the right side ahead. Slow down.",
        "Road Narrows on the Left Side Ahead": "Road narrows on the right side ahead. The left side is clear.",
        "Road Narrows on the Right Side Ahead": "The road narrows on the right side. Keep right.",
        "Road Work Ahead": "Road Work with Narrows on the Right Side Ahead",
        "Speed Limit 100km/h": "Road narrows on the right side ahead. Speed limit is 100 km/h.",
        "Speed Limit 60km/h": "Road narrows on the right side ahead. Speed limit is 60 km/h.",
        "Speed Limit 70km/h": "Road narrows on the right side ahead. Speed limit is 70 km/h.",
        "Speed Limit 80km/h": "Road narrows on the right side ahead. Speed limit is 80 km/h."
    },
    "Road Work Ahead": {
        "Children Crossing Ahead": "Road work ahead. Watch for children crossing.",
        "Double Bend to Left Ahead": "Road work ahead. Prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "Road work ahead. Get ready for a double bend to the right.",
        "Left Bend Ahead": "Road work ahead. A left bend is coming up.",
        "Level Crossing with Gates Ahead": "Road work ahead. Level crossing with gates is coming up.",
        "No Entry": "Road work ahead. No entry is ahead, plan your route.",
        "No Left Turn": "Road work ahead. No left turn is allowed ahead.",
        "No Right Turn": "Road work ahead. No right turn is allowed ahead.",
        "No U-turn": "Road work ahead. No U-turn is allowed.",
        "Pedestrian Crossing": "Road work ahead. Watch for pedestrians crossing.",
        "Pedestrian Crossing Ahead": "Road work ahead. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "Road work ahead. A right bend is coming up.",
        "Road Narrows Ahead": "Road work ahead. The road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "road narrows on the left side! be careful.",
        "Road Narrows on the Right Side Ahead": "Road work ahead. The road narrows on the right side.",
        "Road Work Ahead": "Road work ahead. Slow down and be cautious.",
        "Speed Limit 100km/h": "Road work ahead. Speed limit is 100 km/h.",
        "Speed Limit 60km/h": "Road work ahead. Speed limit is 60 km/h.",
        "Speed Limit 70km/h": "Road work ahead. Speed limit is 70 km/h.",
        "Speed Limit 80km/h": "Road work ahead. Speed limit is 80 km/h."
    },
    "Speed Limit 100km/h": {
        "Children Crossing Ahead": "Speed limit is 100 km/h. Watch for children crossing.",
        "Double Bend to Left Ahead": "Speed limit is 100 km/h. Prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "Speed limit is 100 km/h. Get ready for a double bend to the right.",
        "Left Bend Ahead": "Speed limit is 100 km/h. A left bend is ahead.",
        "Level Crossing with Gates Ahead": "Speed limit is 100 km/h. Level crossing with gates is coming up.",
        "No Entry": "Speed limit is 100 km/h. No entry is ahead, plan your route.",
        "No Left Turn": "Speed limit is 100 km/h. No left turn is allowed ahead.",
        "No Right Turn": "Speed limit is 100 km/h. No right turn is allowed ahead.",
        "No U-turn": "Speed limit is 100 km/h. No U-turn is allowed.",
        "Pedestrian Crossing": "Speed limit is 100 km/h. Watch for pedestrians crossing.",
        "Pedestrian Crossing Ahead": "Speed limit is 100 km/h. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "Speed limit is 100 km/h. A right bend is coming up.",
        "Road Narrows Ahead": "Speed limit is 100 km/h. The road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "Speed limit is 100 km/h. The road narrows on the left side.",
        "Road Narrows on the Right Side Ahead": "Speed limit is 100 km/h. The road narrows on the right side.",
        "Road Work Ahead": "Speed limit is 100 km/h. Road work is ahead.",
        "Speed Limit 100km/h": "Speed limit is 100 km/h. Maintain speed and drive safely.",
        "Speed Limit 60km/h": "Speed limit is 100 km/h. Next, the limit will change to 60 km/h.",
        "Speed Limit 70km/h": "Speed limit is 100 km/h. Next, the limit will change to 70 km/h.",
        "Speed Limit 80km/h": "Speed limit is 100 km/h. Next, the limit will change to 80 km/h."
    },
    "Speed Limit 60km/h": {
        "Children Crossing Ahead": "Speed limit is 60 km/h. Watch for children crossing.",
        "Double Bend to Left Ahead": "Speed limit is 60 km/h. Prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "Speed limit is 60 km/h. Get ready for a double bend to the right.",
        "Left Bend Ahead": "Speed limit is 60 km/h. A left bend is ahead.",
        "Level Crossing with Gates Ahead": "Speed limit is 60 km/h. Level crossing with gates is coming up.",
        "No Entry": "Speed limit is 60 km/h. No entry is ahead, plan your route.",
        "No Left Turn": "Speed limit is 60 km/h. No left turn is allowed ahead.",
        "No Right Turn": "Speed limit is 60 km/h. No right turn is allowed ahead.",
        "No U-turn": "Speed limit is 60 km/h. No U-turn is allowed.",
        "Pedestrian Crossing": "Speed limit is 60 km/h. Watch for pedestrians crossing.",
        "Pedestrian Crossing Ahead": "Speed limit is 60 km/h. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "Speed limit is 60 km/h. A right bend is coming up.",
        "Road Narrows Ahead": "Speed limit is 60 km/h. The road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "Speed limit is 60 km/h. The road narrows on the left side.",
        "Road Narrows on the Right Side Ahead": "Speed limit is 60 km/h. The road narrows on the right side.",
        "Road Work Ahead": "Speed limit is 60 km/h. Road work is ahead.",
        "Speed Limit 100km/h": "Speed limit is 60 km/h. Next, the limit will change to 100 km/h.",
        "Speed Limit 60km/h": "Speed limit is 60 km/h. Drive safely.",
        "Speed Limit 70km/h": "Please maintain your speed at 70km/h",
        "Speed Limit 80km/h": "Speed limit is 60 km/h. Next, the limit will change to 80 km/h."
    },
    "Speed Limit 70km/h": {
        "Children Crossing Ahead": "Speed limit is 70 km/h. Watch for children crossing.",
        "Double Bend to Left Ahead": "Speed limit is 70 km/h. Prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "Speed limit is 70 km/h. Get ready for a double bend to the right.",
        "Left Bend Ahead": "Speed limit is 70 km/h. A left bend is ahead.",
        "Level Crossing with Gates Ahead": "And also careful with level crossing with gates ahead.",
        "No Entry": "Speed limit is 70 km/h. No entry is ahead, plan your route.",
        "No Left Turn": "Speed limit is 70 km/h. No left turn is allowed ahead.",
        "No Right Turn": "Speed limit is 70 km/h. No right turn is allowed ahead.",
        "No U-turn": "Speed limit is 70 km/h. No U-turn is allowed.",
        "Pedestrian Crossing": "Speed limit is 70 km/h. Watch for pedestrians crossing.",
        "Pedestrian Crossing Ahead": "Speed limit is 70 km/h. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "Speed limit is 70 km/h. A right bend is coming up.",
        "Road Narrows Ahead": "Speed limit is 70 km/h. The road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "Speed limit is 70 km/h. The road narrows on the left side.",
        "Road Narrows on the Right Side Ahead": "Speed limit is 70 km/h. The road narrows on the right side.",
        "Road Work Ahead": "Speed limit is 70 km/h. Road work is ahead.",
        "Speed Limit 100km/h": "Speed limit is 70 km/h. Next, the limit will change to 100 km/h.",
        "Speed Limit 60km/h": "Speed limit is 70 km/h. Next, the limit will change to 60 km/h.",
        "Speed Limit 70km/h": "Speed limit is 70 km/h. Drive safely.",
        "Speed Limit 80km/h": "Speed limit is 70 km/h. Next, the limit will change to 80 km/h."
    },
    "Speed Limit 80km/h": {
        "Children Crossing Ahead": "Speed limit is 80 km/h. Watch for children crossing.",
        "Double Bend to Left Ahead": "Speed limit is 80 km/h. Prepare for a double bend to the left.",
        "Double Bend to Right Ahead": "Speed limit is 80 km/h. Get ready for a double bend to the right.",
        "Left Bend Ahead": "Speed limit is 80 km/h. A left bend is ahead.",
        "Level Crossing with Gates Ahead": "Speed limit is 80 km/h. Level crossing with gates is coming up.",
        "No Entry": "Speed limit is 80 km/h. No entry is ahead, plan your route.",
        "No Left Turn": "Speed limit is 80 km/h. No left turn is allowed ahead.",
        "No Right Turn": "Speed limit is 80 km/h. No right turn is allowed ahead.",
        "No U-turn": "Speed limit is 80 km/h. No U-turn is allowed.",
        "Pedestrian Crossing": "Speed limit is 80 km/h. Watch for pedestrians crossing.",
        "Pedestrian Crossing Ahead": "Speed limit is 80 km/h. A pedestrian crossing is coming up.",
        "Right Bend Ahead": "Speed limit is 80 km/h. A right bend is coming up.",
        "Road Narrows Ahead": "Speed limit is 80 km/h. The road narrows ahead.",
        "Road Narrows on the Left Side Ahead": "Speed limit is 80 km/h. The road narrows on the left side.",
        "Road Narrows on the Right Side Ahead": "Speed limit is 80 km/h. The road narrows on the right side.",
        "Road Work Ahead": "Speed limit is 80 km/h. Road work is ahead.",
        "Speed Limit 100km/h": "Speed limit is 80 km/h. Next, the limit will change to 100 km/h.",
        "Speed Limit 60km/h": "Speed limit is 80 km/h. Next, the limit will change to 60 km/h.",
        "Speed Limit 70km/h": "Speed limit is 80 km/h. Next, the limit will change to 70 km/h.",
        "Speed Limit 80km/h": "Speed limit is 80 km/h. Drive safely."
    }
}